tap "iina/mpv-iina"
tap "koekeishiya/formulae"
tap "openhue/cli"
tap "steipete/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source distributed event streaming platform
brew "kafka"
# Portable Foreign Function Interface library
brew "libffi"
# NaCl networking and cryptography library
brew "libsodium"
# Powerful, lightweight programming language
brew "lua"
# Web and API based SMTP testing tool
brew "mailhog"
# High performance, distributed memory object caching system
brew "memcached"
# Syntax-aware git merge driver
brew "mergiraf"
# Deep clean and optimize your Mac
brew "mole"
# Open source relational database management system
brew "mysql@8.4", restart_service: :changed
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Object-relational database system
brew "postgresql@17", restart_service: :changed
# Prettier daemon
brew "prettierd"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Monitor data's progress through a pipe
brew "pv"
# Ruby version manager
brew "rbenv"
# Safe, concurrent, practical language
brew "rust"
# SOund eXchange: universal sound sample translator
brew "sox"
# Cross-shell prompt for astronauts
brew "starship"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# High-performance data structure server that primarily serves key/value workloads
brew "valkey", restart_service: :changed
# Internet file retriever
brew "wget"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# OpenHue CLI is a command-line interface for interacting with Philips Hue smart lighting systems
brew "openhue/cli/openhue-cli"
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"
# Column-oriented database management system
cask "clickhouse"
cask "font-symbols-only-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Speech to text application
cask "handy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Voice to text app
cask "voiceink"
vscode "enkia.tokyo-night"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mvllow.rose-pine"
vscode "pmndrs.pmndrs"
vscode "sallar.vscode-duotone-dark"
vscode "vscodevim.vim"
